["A camera zozes around as the person is in a conversation with someone on either side.", "A young man stands still for about 10 minutes while staring off in one corner, lost.", "I was standing outside on that beautiful afternoon, watching this young boy and his mother.", "The movie was about two brothers trying not get shot at as two opposing factions engage.", "The movie had impressive action scenes which were skilllessly portrayed and had impressive special features.", "Human action, such a person's hand, arm reaching to grasp something from off-camera.", "In an action sequence that takes up several screens and involves intense fight between two individuals.", "Human motion, such is seen here in this motion scene, demonstrates that it's impossible.", "This video showcases some interesting human locomotory motion scenes captured by motion-captured technology in the past two to 3 year, and the video is a part-of a", "In an early stage in the history when there are no cars, there may seem as many different ways to move.", "It involves two characters, one in each body or on either of four limbs.", "I was standing on an airplane, waiting anxuously, when suddenly something hit and the seatbelt sign on, and the door to the aircraft was open! I was in a", "The movie is a classic with a great storyline that leaves you wanting it all.", "The movie was beautifully framed, showing each detail beautifully on a clear blue background in perfect detail.", "A camera zozes around an object to catch its reflection off its reflective material.", "In an early stage in my career as an assistant editor I watched as I was assigned scenes that would be the first of a new show, a new show in a new time", "A man runs on an open-ended treadmill, which he pedals with the help.", "The camera moves across and through different perspectives in this stunning action movie that will keep anyone hooked.", "The movie shows us two astronauts engaged by eachother's eyes in conversation on Earth.", "I was standing on an airplane, waiting anxuously, and then I realized that something was wrong, the engine was not making a lot, the flight was not in a good"]